{"class_name": "Model", "config": {"name": "model_31", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_82"}, "name": "input_82", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_76", "trainable": true, "batch_input_shape": [null, 191], "dtype": "float32", "input_dim": 309, "output_dim": 25, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 191}, "name": "embedding_76", "inbound_nodes": [[["input_82", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_93", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.4, "recurrent_dropout": 0.4, "implementation": 2}, "name": "lstm_93", "inbound_nodes": [[["embedding_76", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "dtype": "float32", "units": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed_4", "inbound_nodes": [[["lstm_93", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_4", "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_4", "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_4", "trainable": true, "dtype": "float32", "n": 128}, "name": "repeat_vector_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_4", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "name": "permute_4", "inbound_nodes": [[["repeat_vector_4", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_4", "trainable": true, "dtype": "float32"}, "name": "multiply_4", "inbound_nodes": [[["lstm_93", 0, 0, {}], ["permute_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcwwAAAB0AHwAZAFkAo0CUwApA07pAQAAACkB2gRheGlzKQHa\nBEtzdW0pAdoDeGluqQByBQAAAPogPGlweXRob24taW5wdXQtNDI3LWQ0NzQ3M2RkZDFjYj7aCDxs\nYW1iZGE+GQAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["multiply_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 53, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_63", "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}], "input_layers": [["input_82", 0, 0]], "output_layers": [["dense_63", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}